# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
# 4 4 -> 2 2 
# 5 6 -> 2 3 

sum_of_numbers = int(input("Введите сумму чисел: "))
product_of_numbers = int(input("Введите произведение чисел: "))

for i in range(sum_of_numbers):
    for j in range(product_of_numbers):
        if sum_of_numbers == i + j and product_of_numbers == i * j:
            print(i, j)